app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE (1) LIMIT ?  [["LIMIT", 1]]
---
    def show
        @user = User.find_by(params[:id])

INSERT INTO "users" ("email", "password_digest", "session_token", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)
---
    def create
        @user = User.new(user_params)
        if @user.save